---
kind: method
id: M:Autodesk.Revit.DB.PolymeshTopology.Dispose
source: html/4214929d-48d6-f259-1cfb-9ec236d7bcbe.htm
---
# Autodesk.Revit.DB.PolymeshTopology.Dispose Method

Releases all resources used by the PolymeshTopology

## Syntax (C#)
```csharp
public void Dispose()
```